* 古い形式のブログ記事を変換するおしごと [WIP]
  :PROPERTIES:
  :DATE: [2021-12-02 Thu 14:25]
  :TAGS: :blog:
  :BLOG_POST_KIND: Memo
  :BLOG_POST_PROGRESS: WIP
  :BLOG_POST_STATUS: Normal
  :END:
  :LOGBOOK:
  CLOCK: [2021-12-02 Thu 13:00]--[2021-12-02 Thu 14:47] =>  1:47
  :END:
  
*** 2. Yaml部分からメタデータを取得する
    
    #+HEADER: :noweb-ref migration-script
    #+begin_src sh
      let target = ./2021-01-03-fomantic-ui.md
      let metadata = (awk '
      <<extract-yaml-metadata>>
      ' $target | from yaml)
    #+end_src


    #+begin_src sh
      <<migration-script>>

      echo $metadata
    #+end_src

    #+RESULTS:
      #           title            author        tags            date      
    ───────────────────────────────────────────────────────────────────────
      0   ブログの見た目を整える   Cj-bc    [table 3 rows]   Jan 03, 2021  

**** タグをOrg形式に変換する
     org形式のタグはタグ名を ~:~ で囲んだものになります。
     タグ名はメタデータ内にリストとして持っているので、nushellの ~reduce~
     コマンドで整形します。

     #+HEADERS: :noweb-ref migration-script
     #+begin_src sh
       def formatTags [tags: table] {
	   $tags | reduce -f ':' { $acc + $it + ':' }
       }
     #+end_src
     
     #+begin_src sh
       <<migration-script>>
       formatTags $metadata.tags
     #+end_src

     #+RESULTS:
     :hakyll:ブログ:haskell:

